ci4/ci/ci4/app/Controllers/Artikel.php

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel 3', 'Aggduhdifuhhrgghrihg', 'Artikel-3')
---
public function add()
{
// validasi data.
$validation = \Config\Services::validation();
$validation->setRules(['judul' => 'required']);
$isDataValid = $validation->withRequest($this->request)->run();
if ($isDataValid)
{
$artikel = new ArtikelModel();
$artikel->insert([
'judul' => $this->request->getPost('judul'),
'isi' => $this->request->getPost('isi'),
'slug' => url_title($this->request->getPost('judul')),
]);

DELETE FROM `artikel`
WHERE `id` IN ('3')
---
 public function delete($id)
 {
 $artikel = new ArtikelModel();
 $artikel->delete($id);